#include <stdio.h>   //підключення потрібних бібліотек для програми stdio.h-забезпечує виконання printf()(введення тексту),scanf()(зчитування даних з клавіатури)
#include <stdlib.h>  //містить у собі функції, що займаються виділенням пам'яті, контролем процесу виконання програми, перетворенням типів та інші
#include <windows.h> //містить оголошення для всіх функцій Windows API, усі звичайні макроси, які використовуються програмістами Windows, і всі типи даних, які використовуються різними функціями та підсистеми
#include <stdlib.h>  //для того, щоб мати змогу застосовувати функцію system("cls")

#define Name "Vladyslav "  //директива препроцесора Name-константа, а вже моє їм'я - це значення
#define LastName "Bovsunivskyi"
#define GroupName "RS-31"
#define Faculty "RTF"
#define University "Igor Sikorsky Kyiv Polytechnic Institute"

int main() //функція
{
unsigned int semestr;  // unsigned int (1 bit)
float admissionScore;  //float (32 bit, 0...255)
int grade1;            //int (32 bit, – 2 147 483 368 … 2 147 483 367)
int grade2;            //оцінка 1...2...3..
int grade3;
int grade4;
int grade5;
double averageGrade;   //double (64 біта), середнє значення оцінки
unsigned int age;      //вік
SetConsoleCP (1251);   //встановлює кодировку виведення на консоль
SetConsoleOutputCP(1251); //встановлює кодировку входу з консолі і з редактора коду

printf("%s%s Виконайте наступні дії .\n", Name, LastName); //вивід імені та прізвища студента, %s — введення/виведення символьного рядка (набору символів).

printf("Введіть номер семестру:"); //вивід запитання.
scanf("%u", &semestr);    //функція вводу, %u — введення/виведення беззнакових цілих десяткових чисел.

printf("Введіть свій вступний бал: ");
scanf("%f", &admissionScore); //%f — введення/виведення чисел типу float.


printf("Введіть оцінку за предмет #1: ");
scanf("%d", &grade1); //%d або %i — введення/виведення цілих десяткових чисел із знаком.

printf("Введіть оцінку за предмет #2:");
scanf("%d", &grade2);

printf("Введіть оцінку за предмет #3:");
scanf("%d", &grade4);

printf("Введіть оцінку за предмет #4:");
scanf("%d", &grade5);

printf("Введіть оцінку за предмет #5:");
scanf("%d", &grade3);

printf("Введіть свій вік: ");
scanf("%u", &age);

averageGrade = (double)(grade1 + grade2 + grade3 + grade4 + grade5) / 5; //записуємо в нашу змінну averageGrade разультати обчислень, та вказуємо їх тип в дужка (double)

system("cls"); //очистити командне вікно від тексту
printf("%s", University); //%s — введення/виведення символьного рядка (набору символів), виведення назви університету, яка записана в змінній University.
printf("\n%s", Faculty); //виведення назви факультету, яка записана в змінній Faculty.
printf("\n%s", GroupName); //виведення назви групи, яка записана в змінній GroupName.
printf("\n---------------------------------"); //потрібно 15, але тоді таблиця не зовсім то і таблиця
printf("\nСтудент: %s %s", Name, LastName ); //виведення імені та прізвища студента.
printf("\nВік: %u", age); //його вік.
printf("\nСеместр: %u", semestr); //номеру семестру.
printf("\n=================================");
printf("\nВступний бал: %.2f", admissionScore); //вступного балу
printf("\nСередня оцінка = %.3lf", averageGrade); //середнього балу, по трьом предметам
printf("\n"); // \n - щоб текст писався з нового рядка, або певний відступ

  return 0;
}
